# 1.

In [4]:
import pandas as pan
list1 = [2,4,5,6,7,9,12,15]

list_res = pan.Series(list1)
print(list_res)

0     2
1     4
2     5
3     6
4     7
5     9
6    12
7    15
dtype: int64

# 2.

In [20]:
list_1 = [2,4,5,6,7,9,12,15]

list_odd = pan.Series(i for i in list_1 if i%2 == 1)
print(list_odd)

0     5
1     7
2     9
3    15
dtype: int64

# 3.

In [8]:
dict1 = {
    'name':['AAA','BBB','CCC'],
    'age':[22,25,24],
    'occ':['engineer','doctor','accountant']
}

data_frame = pan.DataFrame(dict1)
print(data_frame)

  name  age         occ
0  AAA   22    engineer
1  BBB   25      doctor
2  CCC   24  accountant

# 4.

In [13]:
list1 = [[2, 'AAA', 22],[1, 'BBB', 25],[1, 'CCC', 24]]

frame = pan.DataFrame(list1)
print(frame)

   0    1   2
0  2  AAA  22
1  1  BBB  25
2  1  CCC  24

In [ ]:
import datetime
import pandas as pd
 
# initializing date
test_date = datetime.datetime.strptime("01-7-2022", "%d-%m-%Y")
 
# initializing K 
K = 5
 
date_generated = pd.date_range(test_date, periods=K)
print(date_generated.strftime("%d-%m-%Y"))

In [15]:
test_date = datetime.datetime(1997, 1, 4), K == 5

NameError: name 'datetime' is not defined

# 5.

In [52]:
date = pan.date_range(start='2021-05-01',end='2021-05-12')
print(date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

# 6.

In [ ]:
j = pan.read_csv(r'C:\Users\HP\Desktop\kirann.csv')

In [34]:
j.shape

(10, 4)

In [43]:
j.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         10 non-null     object
 1   Company      10 non-null     object
 2   Designation  10 non-null     object
 3   Salary       10 non-null     int64
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

In [44]:
j.describe()

             Salary
count     10.000000
mean   44259.700000
std    24316.922105
min    14589.000000
25%    27916.250000
50%    40889.000000
75%    50371.000000
max    99888.000000

In [35]:
j.columns

Index(['Name', 'Company', 'Designation', 'Salary'], dtype='object')

In [36]:
j[['Name','Company']]

  Name   Company
0    A     Apple
1    B      Meta
2    C         X
3    D      Uber
4    E     Tesla
5    F       Ibm
6    G    Google
7    H    Amazon
8    I  Flipkart
9    J   Alibaba

In [37]:
j.head()

  Name Company Designation  Salary
0    A   Apple     Manager   52000
1    B    Meta    Enginner   32000
2    C       X   Scientist   45200
3    D    Uber       Clerk   25654
4    E   Tesla   Associate   26555

In [38]:
j.tail()

  Name   Company Designation  Salary
5    F       Ibm        Desk   14589
6    G    Google    Backend    36578
7    H    Amazon    Frontend   45484
8    I  Flipkart  Operations   64649
9    J   Alibaba     Exports   99888

In [39]:
j['Name'].value_counts()

A    1
B    1
C    1
D    1
E    1
F    1
G    1
H    1
I    1
J    1
Name: Name, dtype: int64

In [40]:
j['Salary'].sort_values()

5    14589
3    25654
4    26555
1    32000
6    36578
2    45200
7    45484
0    52000
8    64649
9    99888
Name: Salary, dtype: int64

In [42]:
j['Salary'].sort_values(ascending=False)

9    99888
8    64649
0    52000
7    45484
2    45200
6    36578
1    32000
4    26555
3    25654
5    14589
Name: Salary, dtype: int64

In [46]:
print(j.loc[2])

Name                   C
Company                X
Designation    Scientist
Salary             45200
Name: 2, dtype: object

In [47]:
j[0:8]

  Name Company Designation  Salary
0    A   Apple     Manager   52000
1    B    Meta    Enginner   32000
2    C       X   Scientist   45200
3    D    Uber       Clerk   25654
4    E   Tesla   Associate   26555
5    F     Ibm        Desk   14589
6    G  Google    Backend    36578
7    H  Amazon    Frontend   45484

In [48]:
j.columns

Index(['Name', 'Company', 'Designation', 'Salary'], dtype='object')

In [49]:
j[['Name','Salary','Designation']]

  Name  Salary Designation
0    A   52000     Manager
1    B   32000    Enginner
2    C   45200   Scientist
3    D   25654       Clerk
4    E   26555   Associate
5    F   14589        Desk
6    G   36578    Backend
7    H   45484    Frontend
8    I   64649  Operations
9    J   99888     Exports

# 6.1

In [32]:
kir = pan.DataFrame(j)
print(kir)

  Name   Company Designation  Salary
0    A     Apple     Manager   52000
1    B      Meta    Enginner   32000
2    C         X   Scientist   45200
3    D      Uber       Clerk   25654
4    E     Tesla   Associate   26555
5    F       Ibm        Desk   14589
6    G    Google    Backend    36578
7    H    Amazon    Frontend   45484
8    I  Flipkart  Operations   64649
9    J   Alibaba     Exports   99888

# 6.2

In [51]:
my_ind = pan.DataFrame(j, index = [1,2,3,4,5,6,7,8,9,10])
print(my_ind)

   Name   Company Designation   Salary
1     B      Meta    Enginner  32000.0
2     C         X   Scientist  45200.0
3     D      Uber       Clerk  25654.0
4     E     Tesla   Associate  26555.0
5     F       Ibm        Desk  14589.0
6     G    Google    Backend   36578.0
7     H    Amazon    Frontend  45484.0
8     I  Flipkart  Operations  64649.0
9     J   Alibaba     Exports  99888.0
10  NaN       NaN         NaN      NaN